app/views/projects/_form.html.erb

SELECT "users"."id" FROM "users" INNER JOIN "user_projects" ON "users"."id" = "user_projects"."user_id" WHERE "user_projects"."project_id" = $1  [["project_id", 67]]
---
        <br>
        <%= check_box_tag 'users[]', user.id,
          added_users.ids.include?(user.id) %>