app/controllers/articles_controller.rb

  def index
    @articles = Article.order(created_at: :desc)
---
SELECT "articles".* FROM "articles" ORDER BY "articles"."created_at" DESC

  def create
    @article = Article.new(article_params)

    respond_to do |format|
      if @article.save
---
INSERT INTO "articles" ("title", "content", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "Blank"], ["content", ""], ["created_at", "2022-03-21 06:10:48.968956"], ["updated_at", "2022-03-21 06:10:48.968956"]]