app/controllers/bugs_controller.rb

  def index
    # puts("I am in bugs :-)")
    # puts(current_user.email)
    if current_user.role == "project_manager" || current_user.role == "admin"
      @bugs = @project.bugs
    else
      @bugs = @project.bugs.where(user_id: current_user.id)
---
SELECT "bugs".* FROM "bugs" WHERE "bugs"."project_id" = $1 AND "bugs"."user_id" = $2  [["project_id", 77], ["user_id", 46]]

  def new
    # puts("I am bug")
    @users = @project.users.where(role: "developer")
---
SELECT "users".* FROM "users" INNER JOIN "user_projects" ON "users"."id" = "user_projects"."user_id" WHERE "user_projects"."project_id" = $1 AND "users"."role" = $2  [["project_id", 77], ["role", 1]]

  def edit
    @users = @project.users.where(role: "developer")
---
SELECT "users".* FROM "users" INNER JOIN "user_projects" ON "users"."id" = "user_projects"."user_id" WHERE "user_projects"."project_id" = $1 AND "users"."role" = $2  [["project_id", 77], ["role", 1]]

  def create
    @bug = @project.bugs.build(bug_params)

    if @bug.save
---
INSERT INTO "bugs" ("bug_name", "detail", "status", "project_id", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

  def update
    if @bug.update(bug_params)
---
UPDATE "bugs" SET "updated_at" = $1, "user_id" = $2 WHERE "bugs"."id" = $3  [["updated_at", "2022-03-28 11:33:44.097736"], ["user_id", 45], ["id", 5]]

  def destroy
    @bug.destroy
---
DELETE FROM "bugs" WHERE "bugs"."id" = $1  [["id", 6]]

    def set_bug
      @bug = @project.bugs.find(params[:id])
---
SELECT "bugs".* FROM "bugs" WHERE "bugs"."project_id" = $1 AND "bugs"."id" = $2 LIMIT $3  [["project_id", 77], ["id", 13], ["LIMIT", 1]]