app/controllers/features_controller.rb

INSERT INTO "features" ("feature_name", "status", "project_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["feature_name", "RomeIV"], ["status", 0], ["project_id", 2], ["created_at", "2022-03-24 07:42:47.676336"], ["updated_at", "2022-03-24 07:42:47.676336"]]
---
  def create
    @feature = @project.features.build(feature_params)

    if @feature.save

UPDATE "features" SET "feature_name" = $1, "updated_at" = $2 WHERE "features"."id" = $3  [["feature_name", "GHQ1"], ["updated_at", "2022-03-24 07:36:34.505541"], ["id", 1]]
---
  def update
    if @feature.update(feature_params)

SELECT "features".* FROM "features" WHERE "features"."project_id" = $1 AND "features"."id" = $2 LIMIT $3  [["project_id", 2], ["id", 1], ["LIMIT", 1]]
---
    def set_feature
      @feature = @project.features.find(params[:id])