app/controllers/projects_controller.rb

SELECT "projects".* FROM "projects" WHERE "projects"."id" = $1 LIMIT $2  [["id", 20], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
---
  def create
    @project = Project.new(project_params)
    puts("start")

    # users = params[:users]

    # users.each do |user|
    #   add_user = User.find_by id: user
    #   puts(add_user.email)
    # end

    # add_user = User.find_by id: users[2]
    # puts(add_user.email)


    respond_to do |format|
      if @project.save
        saved_project = Project.find_by id: @project.id
        saved_project.users.push(current_user)
        users = params[:users]

        users.each do |user|
          add_user = User.find_by id: user