app/controllers/projects_controller.rb

SELECT "projects".* FROM "projects" WHERE "projects"."project_manager_id" = $1  [["project_manager_id", 1]]
---
  def index
    puts("current user")
    puts(current_user.id)
    if current_user.role == "project_manager"
      puts("if")
      @projects = Project.where(project_manager_id:current_user.id)

SELECT "projects".* FROM "projects" WHERE "projects"."id" = $1 LIMIT $2  [["id", 72], ["LIMIT", 1]]
SELECT "projects".* FROM "projects" WHERE "projects"."id" = $1 LIMIT $2  [["id", 16], ["LIMIT", 1]]
SELECT "users"."id" FROM "users" INNER JOIN "user_projects" ON "users"."id" = "user_projects"."user_id" WHERE "user_projects"."project_id" = $1  [["project_id", 72]]
---
  def show
    @project = Project.find(params[:id])
    # puts("show")
    # puts(current_user.id)
    # puts(@project.users.ids)


    if !(@project.users.ids.include?(current_user.id) || @project.project_manager_id == current_user.id)

SELECT "users".* FROM "users" ORDER BY "users"."id" ASC LIMIT $1  [["LIMIT", 1]]
---
  def new

    @project = Project.new
    @users = User.all

SELECT "users"."id" FROM "users"
---
  def edit
    # puts("start")
    # puts(@project.name)
    @added_users = @project.users
    @created_by = current_user.id
    puts("cr_id")
    puts(@created_by)

    # puts(@added_users)
    @users = User.all

INSERT INTO "projects" ("name", "created_at", "updated_at", "project_manager_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "YUOM"], ["created_at", "2022-03-28 07:34:59.303094"], ["updated_at", "2022-03-28 07:34:59.303094"], ["project_manager_id", 39]]
SELECT "projects".* FROM "projects" WHERE "projects"."id" = $1 LIMIT $2  [["id", 16], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 41], ["LIMIT", 1]]
INSERT INTO "user_projects" ("project_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["project_id", 77], ["user_id", 41], ["created_at", "2022-03-28 07:34:59.325441"], ["updated_at", "2022-03-28 07:34:59.325441"]]
UPDATE "projects" SET "name" = $1, "updated_at" = $2 WHERE "projects"."id" = $3  [["name", "IBEX"], ["updated_at", "2022-03-25 07:20:20.761422"], ["id", 21]]
---
  def create
    @project = Project.new(project_params)
    puts("start")

    # users = params[:users]

    # users.each do |user|
    #   add_user = User.find_by id: user
    #   puts(add_user.email)
    # end

    # add_user = User.find_by id: users[2]
    # puts(add_user.email)


    respond_to do |format|
      if @project.save
        saved_project = Project.find_by id: @project.id
        users = params[:users]

        users.each do |user|
          add_user = User.find_by id: user
          saved_project.users.push(add_user)

SELECT "users"."id" FROM "users" INNER JOIN "user_projects" ON "users"."id" = "user_projects"."user_id" WHERE "user_projects"."project_id" = $1  [["project_id", 77]]
DELETE FROM "user_projects" WHERE "user_projects"."project_id" = $1 AND "user_projects"."user_id" = $2  [["project_id", 62], ["user_id", 19]]
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 4]]
---
  def update
    puts(params)
    respond_to do |format|
      puts("start")
      # puts(@project.users)
      users = params[:users]
      saved_project = @project
      ids_array = saved_project.users.ids
      puts("already")
      puts(ids_array)
      puts("from checboxes")
      puts(users)

      puts("condition")

      x = []
      users.each do |user|
        x.push(user.to_i)
      end
      ids_array.each do |id_|
        puts(x.include?(id_))
      end
      ids_array.each do |id_|
        if !(x.include?(id_))
          y = UserProject.where(project_id: saved_project.id, user_id: id_)
          y.delete_all

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 44], ["LIMIT", 1]]
UPDATE "projects" SET "updated_at" = $1, "project_manager_id" = $2 WHERE "projects"."id" = $3  [["updated_at", "2022-03-27 19:10:36.499014"], ["project_manager_id", 39], ["id", 75]]
INSERT INTO "user_projects" ("project_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["project_id", 77], ["user_id", 44], ["created_at", "2022-03-28 11:25:25.740952"], ["updated_at", "2022-03-28 11:25:25.740952"]]
---
      users.each do |user|
        # puts(ids_array.include?(user.to_i))
        if !(ids_array.include?(user.to_i))
          add_user = User.find_by id: user
          saved_project.users.push(add_user)

DELETE FROM "user_projects" WHERE "user_projects"."id" = $1  [["id", 32]]
---
  def destroy
    @project.destroy