app/controllers/projects_controller.rb

  def create
    @project = Project.new(project_params)
    puts("start")

    # users = params[:users]

    # users.each do |user|
    #   add_user = User.find_by id: user
    #   puts(add_user.email)
    # end

    # add_user = User.find_by id: users[2]
    # puts(add_user.email)


    respond_to do |format|
      if @project.save
        saved_project = Project.find_by id: @project.id
        users = params[:users]

        users.each do |user|
          add_user = User.find_by id: user
          saved_project.users.push(add_user)
---
INSERT INTO "projects" ("name", "created_at", "updated_at", "project_manager_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "She"], ["created_at", "2022-03-27 17:22:31.520339"], ["updated_at", "2022-03-27 17:22:31.520339"], ["project_manager_id", nil]]
SELECT "projects".* FROM "projects" WHERE "projects"."id" = $1 LIMIT $2  [["id", 21], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "projects" SET "name" = $1, "updated_at" = $2 WHERE "projects"."id" = $3  [["name", "UUU2"], ["updated_at", "2022-03-25 05:29:41.202939"], ["id", 3]]
INSERT INTO "user_projects" ("project_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["project_id", 27], ["user_id", 6], ["created_at", "2022-03-25 11:07:01.245002"], ["updated_at", "2022-03-25 11:07:01.245002"]]

  def update
    respond_to do |format|
      puts("start")
      # puts(@project.users)
      users = params[:users]
      saved_project = @project
      ids_array = saved_project.users.ids
      puts("already")
      puts(ids_array)
      puts("from checboxes")
      puts(users)

      puts("condition")

      x = []
      users.each do |user|
        x.push(user.to_i)
      end
      ids_array.each do |id_|
        puts(x.include?(id_))
      end
      ids_array.each do |id_|
        if !(x.include?(id_))
          y = UserProject.where(project_id: saved_project.id, user_id: id_)
          y.delete_all
---
SELECT "users"."id" FROM "users" INNER JOIN "projects_users" ON "users"."id" = "projects_users"."user_id" WHERE "projects_users"."project_id" = $1  [["project_id", 21]]
SELECT "users"."id" FROM "users" INNER JOIN "user_projects" ON "users"."id" = "user_projects"."user_id" WHERE "user_projects"."project_id" = $1  [["project_id", 67]]
SELECT "users"."id" FROM "users" INNER JOIN "user_projects" ON "users"."id" = "user_projects"."user_id" WHERE "user_projects"."project_id" = $1  [["project_id", 75]]
DELETE FROM "user_projects" WHERE "user_projects"."project_id" = $1 AND "user_projects"."user_id" = $2  [["project_id", 62], ["user_id", 19]]
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 4]]

      users.each do |user|
        # puts(ids_array.include?(user.to_i))
        if !(ids_array.include?(user.to_i))
          add_user = User.find_by id: user
          saved_project.users.push(add_user)
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 16], ["LIMIT", 1]]
INSERT INTO "user_projects" ("project_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["project_id", 62], ["user_id", 16], ["created_at", "2022-03-27 13:41:51.172992"], ["updated_at", "2022-03-27 13:41:51.172992"]]

  def destroy
    @project.destroy
---
DELETE FROM "user_projects" WHERE "user_projects"."id" = $1  [["id", 12]]