app/controllers/users_controller.rb

SELECT "users".* FROM "users" ORDER BY "users"."created_at" DESC
---
  def index
    @users = User.order(created_at: :desc)

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 38], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 38]]
---
  def destroy
    puts("deleteteeee")
    user = User.find(params[:id])
    # puts(user.email)
    user.destroy